List<int> azkarsnum = [3, 3, 3, 1, 3, 1, 1, 10, 3, 1, 1, 1, 100];
List<Map<String, String>> azkars = [
  lst[0],
  lst[1],
  lst[2],
  lst[3],
  lst[4],
  lst[5],
  lst[6],
  lst[7],
  lst[8],
  {
    "zikr": "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النُّشور",
    "tafsil": "عن أبي هريرة ان النبي ﷺ كان يقولها اذا اصبح",
    'saha': 'حسن'
  },
  {
    "zikr":
        "أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلّا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بكَ من عذابٍ في النار وعذاب في القبر",
    "tafsil": "كان يقوله ﷺ اذا اصبح",
    'saha': 'صحيح'
  },
  {
    "zikr":
        "أصبحنا على فطرة الإسلام، وعلي كلمة الإخلاص، وعلي دين نبينا محمدٍ ﷺ، وعلي ملّة أبينا إبراهيم حنيفًا مسلمًا وما كان من المشركين",
    "tafsil": "من الاذكار الوارده في اذكار الصباح",
    'saha': 'صحيح'
  },
  lst[9],
];
List<Map<String, String>> azkarb = [
  lst[0],
  lst[1],
  lst[2],
  lst[3],
  lst[4],
  lst[5],
  lst[6],
  lst[7],
  //lst[8],
  {
    "zikr": "أعوذُ بكلمَات اللِه التّامات من شرّ ما خَلَق",
    "tafsil":
        "عن أبي هريرة أنه قال جاء رجل إلى النبي ﷺ فقال يا رسول الله ما لقيت من عقرب لدغتني البارحة قال أما لو قلت حين أمسيت أعوذ بكلمات الله التامات من شر ما خلق لم تضرك",
    'saha': 'صحيح'
  },
  {
    "zikr": "اللهم بك أمسينا وبك أصبحنا وبك نحيا، وبك نموت،وإليك المصير",
    "tafsil": "عن أبي هريرة ان النبي ﷺ كان يقولها اذا امسي",
    'saha': 'حسن'
  },
  {
    "zikr":
        "أمسينا وأمسى الملكُ لله، والحمد لله، لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير، ربِّ أسألك خيرَ ما في هذه الليلة، وخيرَ ما بعدها، وأعوذ بك من شرِّ ما في هذه الليلة، وشرِّ ما بعدها، ربِّ أعوذ بك من الكسل، وسُوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار، وعذابٍ في القبر",
    "tafsil": "كان يقوله النبي ﷺ اذا امسي",
    'saha': 'صحيح'
  },
  lst[9],
];
List<int> azkarbnum = [3, 3, 3, 1, 3, 1, 1, 10, 1, 1, 1, 100];
List<Map<String, String>> lst = [
  {
    "zikr":
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم: قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
    "tafsil":
        "من قال (قُلْ هُوَ اللَّهُ أَحَدٌ والمعوذتين حين يمسي ويصبح ثلاث مرات تكفيه من كل شيء)",
    'saha': 'حسن',
  },
  {
    "zikr":
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم: قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "tafsil":
        "من قال (قُلْ هُوَ اللَّهُ أَحَدٌ والمعوذتين حين يمسي ويصبح ثلاث مرات تكفيه من كل شيء)",
    'saha': 'حسن'
  },
  {
    "zikr":
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم: قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
    "tafsil":
        "من قال (قُلْ هُوَ اللَّهُ أَحَدٌ والمعوذتين حين يمسي ويصبح ثلاث مرات تكفيه من كل شيء)",
    'saha': 'حسن'
  },
  {
    "zikr":
        "اللهم أنت ربي، لا إله إلا أنت، خلقتني، وأنا عبدك، وأنا على عهدك ووعدك ما استطعتُ، أعوذ بك من شرِّ ما صنعتُ، أبوء لك بنعمتك عليَّ، وأبوء لك بذنبي، فاغفر لي، فإنَّه لا يغفر الذنوبَ إلا أنت",
    "tafsil":
        "ومَن قالها من النَّهار مُوقِنًا بها، فمات من يومه قبل أن يُمسي؛ فهو من أهل الجنَّة، ومَن قالها من الليل وهو مُوقِنٌ بها، فمات قبل أن يُصبح؛ فهو من أهل الجنَّة",
    'saha': 'صحيح'
  },
  {
    "zikr":
        "بسم الله الذي لا يضرّ مع اسمه شيءٌ في الأرض ولا في السَّماء، وهو السَّميع العليم",
    "tafsil":
        "ما من عبدٍ يقول في صباح كل يومٍ، ومساء كل ليلةٍ: بسم الله الذي لا يضرّ مع اسمه شيءٌ في الأرض ولا في السَّماء، وهو السَّميع العليم، ثلاث مرات، فيضرّه شيءٌ",
    'saha': 'حسن'
  },
  {
    "zikr":
        "اللهم عالم الغيب والشَّهادة، فاطر السَّماوات والأرض، ربَّ كل شيءٍ ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شرِّ نفسي، ومن شرِّ الشيطانِ وشِرْكِه",
    "tafsil":
        "جاء عن أبي هريرة  قال: قال أبو بكر  يا رسول الله، مُرني بشيءٍ أقوله إذا أصبحتُ، وإذا أمسيتُ. قال:اللهم عالم الغيب والشهاده الي اخره ، قال: قُلْه إذا أصبحتَ، وإذا أمسيتَ، وإذا أخذتَ مضجعك",
    'saha': 'صحيح'
  },
  {
    "zikr":
        "اللهم إني أسألك العافيةَ في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودُنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، اللهم احفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أُغتال من تحتي",
    "tafsil":
        "جاء عن عبدالله بن عمر أنَّه قال: لم يكن رسولُ الله ﷺ يدع هؤلاءالدَّعوات حين يُمسي وحين يُصبح",
    'saha': 'صحيح'
  },
  {
    "zikr":
        "لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير",
    "tafsil":
        " من قالها كَتَبَ اللهُ له بكُلِّ واحدةٍ قالها عَشْرَ حَسَناتٍ، وحَطَّ اللهُ عنه بها عَشْرَ سيِّئاتٍ، ورَفَعَه اللهُ بها عَشْرَ دَرَجاتٍ، وكُنَّ له كعَشْرِ رقابٍ، وكُنَّ له مَسلَحةً مِن أوَّلِ النَّهارِ إلى آخِرِه، ولم يَعمَلْ يَومَئذٍ عَمَلًا يَقهَرُهُنَّ، فإنْ قال حين يُمْسي، فمِثلُ ذلك",
    'saha': 'حسن'
  },
  {
    "zikr": "سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ",
    "tafsil":
        " عن جويرية أن النبي ﷺ خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال: مازلت على الحال التي فارقتك عليها؟ قالت: نعم قال النبي ﷺ: لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن: سبحان الله وبحمده، عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته وفي روايه  سبحان الله وبحمده سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته",
    'saha': 'صحيح'
  },
  {
    "zikr": "سبحان الله وبحمده",
    "tafsil":
        "مَن قال حين يُصبح وحين يُمسي: سبحان الله وبحمده، مئة مرة، لم يأتِ أحدٌ يوم القيامة بأفضل مما جاء به، إلا أحدٌ قال مثلما قال، أو زاد عليه",
    'saha': 'حسن'
  },
];

String detal =
    'تم اخذ الاذكار من كتاب الصحيح المسند من اذكار اليوم والليلة للشيخ مصطفي العدوي ';
